In [1]:
import pandas as pd
import numpy as np

In [2]:
#創建一維陣列
s = pd.Series([1, 3, 5, np.nan, 6, 8])
print(s)
type(s)

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

pandas.core.series.Series

In [3]:
#生成日期序列
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
#隨機聲稱dataframe
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -0.291917  0.320325 -1.268038 -1.938274
2013-01-02  0.883047  0.218971  1.135810 -1.068714
2013-01-03  1.354918  0.127837 -0.245875 -0.059740
2013-01-04 -0.964754 -0.045375 -2.560684  0.226420
2013-01-05 -0.637140 -0.259310  0.584438 -0.018221
2013-01-06  0.011957 -1.032789  0.548068 -1.516102

In [5]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

print(df2)
df2.dtypes

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [6]:
df.head()
df.tail()
df.index #抓row name
df.columns #抓col name

Index(['A', 'B', 'C', 'D'], dtype='object')

In [7]:
# df轉array
df.to_numpy()

# 注意: 如果df內的col有不同的type，則轉換會很慢沒效率，因為array中都要是同一種type
# 注意: does not include the index or column labels in the output.

array([[-0.29191722,  0.32032452, -1.26803776, -1.93827391],
       [ 0.88304741,  0.21897054,  1.13580955, -1.06871397],
       [ 1.35491846,  0.12783695, -0.24587491, -0.0597395 ],
       [-0.96475375, -0.04537517, -2.56068381,  0.22642045],
       [-0.63713953, -0.25930979,  0.58443804, -0.01822139],
       [ 0.01195724, -1.03278871,  0.54806816, -1.51610174]])

In [8]:
#Summary the df
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.059352 -0.111724 -0.301047 -0.729105
std    0.896270  0.495572  1.386630  0.901468
min   -0.964754 -1.032789 -2.560684 -1.938274
25%   -0.550834 -0.205826 -1.012497 -1.404255
50%   -0.139980  0.041231  0.151097 -0.564227
75%    0.665275  0.196187  0.575346 -0.028601
max    1.354918  0.320325  1.135810  0.226420

In [9]:
#Transpose
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.291917    0.883047    1.354918   -0.964754   -0.637140    0.011957
B    0.320325    0.218971    0.127837   -0.045375   -0.259310   -1.032789
C   -1.268038    1.135810   -0.245875   -2.560684    0.584438    0.548068
D   -1.938274   -1.068714   -0.059740    0.226420   -0.018221   -1.516102

In [10]:
#依照index(rownames or colnames)進行排序
ㄎdf.sort_index(axis=1, ascending=False) #axis=0: 依照rownames, axis=1: 依照colnames

d#s依照value進行排序
ㄎdf.sort_values(by='B')

NameError: name 'ㄎdf' is not defined

In [11]:
#Selection

In [12]:
# 選擇單一col
df['A']

2013-01-01   -0.309406
2013-01-02    0.937429
2013-01-03    0.191623
2013-01-04    0.335333
2013-01-05   -0.658566
2013-01-06   -0.733441
Freq: D, Name: A, dtype: float64

In [13]:
#選取指定範圍的row
df[0:2] #選取第0、1列，不包含尾段
df['2013-01-01':'2013-01-03'] #選取第0、1、2列，包含尾段

                   A         B         C         D
2013-01-01 -0.309406 -1.174792  1.204756 -0.637679
2013-01-02  0.937429 -0.548068 -1.121792 -1.477492
2013-01-03  0.191623 -0.442280  2.126084  1.288772

In [14]:
# 同時篩選col & row，要加上loc

#抓出index符合條件的row
df.loc[dates[0]]

A   -0.309406
B   -1.174792
C    1.204756
D   -0.637679
Name: 2013-01-01 00:00:00, dtype: float64

In [15]:
df.loc[:, ['A', 'B']]

df.loc["20130102":"20130104", ["A", "D"]]

                   A         D
2013-01-02  0.937429 -1.477492
2013-01-03  0.191623  1.288772
2013-01-04  0.335333  0.034442

In [16]:
# Selecting by position
# 用編號選擇row 或 col

#選擇row
df.iloc[3]

#選擇row & col
df.iloc[0:2, 2:4]

#或用list指定不連續位置
df.iloc[[0,2], [1, 3]]

                   B         D
2013-01-01 -1.174792 -0.637679
2013-01-03 -0.442280  1.288772

In [17]:
# Boolean indexing

In [18]:
df[df['A']>0]

                   A         B         C         D
2013-01-02  0.937429 -0.548068 -1.121792 -1.477492
2013-01-03  0.191623 -0.442280  2.126084  1.288772
2013-01-04  0.335333 -2.411343  0.934587  0.034442

In [19]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN       NaN  1.204756       NaN
2013-01-02  0.937429       NaN       NaN       NaN
2013-01-03  0.191623       NaN  2.126084  1.288772
2013-01-04  0.335333       NaN  0.934587  0.034442
2013-01-05       NaN  0.597898       NaN  0.618307
2013-01-06       NaN       NaN       NaN  0.168273

In [20]:
# Filter

In [21]:
df2 = df.copy() #不會更改原本的df
# df2 = df #會更改原本的df，使得df == df2

df2['E'] = ["one", "one", "two", "three", "four", "three"]
df2

                   A         B         C         D      E
2013-01-01 -0.309406 -1.174792  1.204756 -0.637679    one
2013-01-02  0.937429 -0.548068 -1.121792 -1.477492    one
2013-01-03  0.191623 -0.442280  2.126084  1.288772    two
2013-01-04  0.335333 -2.411343  0.934587  0.034442  three
2013-01-05 -0.658566  0.597898 -0.174126  0.618307   four
2013-01-06 -0.733441 -0.982399 -0.855468  0.168273  three

In [22]:
#利用isin()，filter出特定條件的row
df2[df2['E'].isin(['one', 'three'])]

                   A         B         C         D      E
2013-01-01 -0.309406 -1.174792  1.204756 -0.637679    one
2013-01-02  0.937429 -0.548068 -1.121792 -1.477492    one
2013-01-04  0.335333 -2.411343  0.934587  0.034442  three
2013-01-06 -0.733441 -0.982399 -0.855468  0.168273  three

In [23]:
#Setting

In [24]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))
s1

df['F'] = s1
df

                   A         B         C         D    F
2013-01-01 -0.309406 -1.174792  1.204756 -0.637679  NaN
2013-01-02  0.937429 -0.548068 -1.121792 -1.477492  1.0
2013-01-03  0.191623 -0.442280  2.126084  1.288772  2.0
2013-01-04  0.335333 -2.411343  0.934587  0.034442  3.0
2013-01-05 -0.658566  0.597898 -0.174126  0.618307  4.0
2013-01-06 -0.733441 -0.982399 -0.855468  0.168273  5.0

In [25]:
df.loc[dates[0], 'A'] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000 -1.174792  1.204756 -0.637679  NaN
2013-01-02  0.937429 -0.548068 -1.121792 -1.477492  1.0
2013-01-03  0.191623 -0.442280  2.126084  1.288772  2.0
2013-01-04  0.335333 -2.411343  0.934587  0.034442  3.0
2013-01-05 -0.658566  0.597898 -0.174126  0.618307  4.0
2013-01-06 -0.733441 -0.982399 -0.855468  0.168273  5.0

In [33]:
df['D'] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000 -1.174792  1.204756  5  NaN
2013-01-02  0.937429 -0.548068 -1.121792  5  1.0
2013-01-03  0.191623 -0.442280  2.126084  5  2.0
2013-01-04  0.335333 -2.411343  0.934587  5  3.0
2013-01-05 -0.658566  0.597898 -0.174126  5  4.0
2013-01-06 -0.733441 -0.982399 -0.855468  5  5.0

In [ ]:
# Missing value

In [47]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

df1.loc[dates[0] : dates[1], "E"] = 1

df1

                   A         B         C  D    F    E
2013-01-01  0.000000 -1.174792  1.204756  5  NaN  1.0
2013-01-02  0.937429 -0.548068 -1.121792  5  1.0  1.0
2013-01-03  0.191623 -0.442280  2.126084  5  2.0  NaN
2013-01-04  0.335333 -2.411343  0.934587  5  3.0  NaN

In [50]:
# 移除具有NA的row (na.omit)
df1.dropna(how='any') #how='all': 整個row或col都是NA才會去除

                   A         B         C  D    F    E
2013-01-02  0.937429 -0.548068 -1.121792  5  1.0  1.0

In [ ]:
df1.fillna(value=5)

In [51]:
df1.isna()

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [ ]:
#Operation

In [55]:
df.mean() #by col 做mean

df.mean(axis=1) #by row 做mean

# 注意: 如果有nan，都會被忽略

2013-01-01    1.257491
2013-01-02    1.053514
2013-01-03    1.775085
2013-01-04    1.371715
2013-01-05    1.753041
2013-01-06    1.485738
Freq: D, dtype: float64

In [58]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [62]:
# df - s by row，因為維度不一樣，python會brodcast到相同維度
df.sub(s, axis=0)

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.808377 -1.442280  1.126084  4.0  1.0
2013-01-04 -2.664667 -5.411343 -2.065413  2.0  0.0
2013-01-05 -5.658566 -4.402102 -5.174126  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [ ]:
#Apply

In [63]:
#根據每個col去做cums剪去
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000 -1.174792  1.204756   5   NaN
2013-01-02  0.937429 -1.722859  0.082964  10   1.0
2013-01-03  1.129052 -2.165140  2.209047  15   3.0
2013-01-04  1.464385 -4.576483  3.143634  20   6.0
2013-01-05  0.805819 -3.978585  2.969509  25  10.0
2013-01-06  0.072378 -4.960984  2.114040  30  15.0

In [66]:
#根據每個col，用max value減去min value
df.apply(lambda x: x.max() - x.min())

A    1.670870
B    3.009241
C    3.247875
D    0.000000
F    4.000000
dtype: float64

In [ ]:
#Histogramming

In [67]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    6
1    4
2    1
3    2
4    6
5    2
6    2
7    0
8    1
9    6
dtype: int32

In [68]:
#計算每個value出現的次數
s.value_counts()

6    3
2    3
1    2
4    1
0    1
dtype: int64

In [ ]:
#String Methods

In [72]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [73]:
#全部轉小寫
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [ ]:
#Merge

In [74]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  2.028475  0.767530  0.461540 -0.277566
1 -0.662725  0.734140 -0.585730  0.332986
2  0.364115  0.731063 -0.953786  0.289834
3 -0.386570 -0.566387 -1.174475 -0.393248
4 -0.585674 -1.475098 -0.267431  0.110232
5 -0.629438  0.983074 -0.308309 -0.568154
6 -2.554150  0.795758  1.910101 -0.231950
7 -0.357650  1.132465 -1.324988  0.339913
8 -0.760404 -0.458769  0.336684 -0.626609
9 -0.823414  1.636709 -0.160833 -0.387848

In [77]:
pieces = [df[:3], df[3:7], df[7:]] #用list把原始df拆成3段
pieces

[          0         1         2         3
 0  2.028475  0.767530  0.461540 -0.277566
 1 -0.662725  0.734140 -0.585730  0.332986
 2  0.364115  0.731063 -0.953786  0.289834,
           0         1         2         3
 3 -0.386570 -0.566387 -1.174475 -0.393248
 4 -0.585674 -1.475098 -0.267431  0.110232
 5 -0.629438  0.983074 -0.308309 -0.568154
 6 -2.554150  0.795758  1.910101 -0.231950,
           0         1         2         3
 7 -0.357650  1.132465 -1.324988  0.339913
 8 -0.760404 -0.458769  0.336684 -0.626609
 9 -0.823414  1.636709 -0.160833 -0.387848]

In [78]:
pd.concat(pieces)

# 注意: 添加col速度比較快，若是要添加row會慢很多，因此建議先創建一個list，蒐集要合併的row，之後將list concat起來再合併回去df，速度會較快

          0         1         2         3
0  2.028475  0.767530  0.461540 -0.277566
1 -0.662725  0.734140 -0.585730  0.332986
2  0.364115  0.731063 -0.953786  0.289834
3 -0.386570 -0.566387 -1.174475 -0.393248
4 -0.585674 -1.475098 -0.267431  0.110232
5 -0.629438  0.983074 -0.308309 -0.568154
6 -2.554150  0.795758  1.910101 -0.231950
7 -0.357650  1.132465 -1.324988  0.339913
8 -0.760404 -0.458769  0.336684 -0.626609
9 -0.823414  1.636709 -0.160833 -0.387848

In [ ]:
#Join

In [79]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})

pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [80]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})

pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [ ]:
# Grouping (group by)

In [11]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

df

     A      B         C         D
0  foo    one  0.431756 -0.123799
1  bar    one  0.910627  1.561734
2  foo    two  0.381851  1.876600
3  bar  three  0.339771 -0.244823
4  foo    two  0.500692 -0.992808
5  bar    two -0.222031 -0.924014
6  foo    one  1.258080  0.491775
7  foo  three  0.455834 -0.472678

In [14]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one    0.910627  1.561734
    three  0.339771 -0.244823
    two   -0.222031 -0.924014
foo one    1.689836  0.367977
    three  0.455834 -0.472678
    two    0.882543  0.883793

In [ ]:
#Reshaping

In [20]:
tuples = list(
    zip(
        *[
            ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
            ["one", "two", "one", "two", "one", "two", "one", "two"],
        ]
        )
)

index = pd.MultiIndex.from_tuples(tuples, names=["first", "second"])

df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=["A", "B"])

d = df[:4]

df2

                     A         B
first second
bar   one     0.169679  0.625449
      two    -0.678340  1.299079
baz   one    -0.972788  1.560854
      two     1.740383 -0.652467

In [23]:
# 橫轉直
stacked = df2.stack()

stacked

first  second
bar    one     A    0.169679
               B    0.625449
       two     A   -0.678340
               B    1.299079
baz    one     A   -0.972788
               B    1.560854
       two     A    1.740383
               B   -0.652467
dtype: float64

In [24]:
 # 直轉橫
 # which by default unstacks the last level:

stacked.unstack()

                     A         B
first second
bar   one     0.169679  0.625449
      two    -0.678340  1.299079
baz   one    -0.972788  1.560854
      two     1.740383 -0.652467

In [ ]:
# Pivot tables (樞紐分析表)

In [25]:
df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)

df

        A  B    C         D         E
0     one  A  foo -0.675492  1.667875
1     one  B  foo -0.075578 -1.169302
2     two  C  foo  1.517124 -1.405310
3   three  A  bar  0.907333 -0.261043
4     one  B  bar -0.808359 -0.556177
5     one  C  bar -0.753898  0.477656
6     two  A  foo  0.254928  0.685282
7   three  B  foo -0.661044 -0.030489
8     one  C  foo  0.172686 -0.280612
9     one  A  bar -0.922041  0.900280
10    two  B  bar  1.073465  0.457905
11  three  C  bar  1.100280 -0.390527

In [28]:
df.pivot_table(index=['A', 'B'], columns='C', values='D') #default: aggfunc='mean'

C             bar       foo
A     B
one   A -0.922041 -0.675492
      B -0.808359 -0.075578
      C -0.753898  0.172686
three A  0.907333       NaN
      B       NaN -0.661044
      C  1.100280       NaN
two   A       NaN  0.254928
      B  1.073465       NaN
      C       NaN  1.517124

In [ ]:
# Time series

In [32]:
rng = pd.date_range("1/1/2012", periods=100, freq="S") #生成100筆紀錄，以每1秒為單位

ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

ts

2012-01-01 00:00:00    132
2012-01-01 00:00:01     47
2012-01-01 00:00:02    140
2012-01-01 00:00:03    173
2012-01-01 00:00:04     59
                      ...
2012-01-01 00:01:35    234
2012-01-01 00:01:36    156
2012-01-01 00:01:37    444
2012-01-01 00:01:38    205
2012-01-01 00:01:39    143
Freq: S, Length: 100, dtype: int32

In [34]:
ts.resample("1Min").sum() #以每1分鐘去sum數值

2012-01-01 00:00:00    14823
2012-01-01 00:01:00    11108
Freq: T, dtype: int32

In [43]:
rng = pd.date_range("1/1/2012", periods=5, freq="M")

ts = pd.Series(np.random.randn(len(rng)), index=rng)

ts

2012-01-31   -0.596553
2012-02-29    0.762417
2012-03-31   -0.988757
2012-04-30   -0.925194
2012-05-31    1.150498
Freq: M, dtype: float64

In [49]:
ps = ts.to_period(freq = 'M')

ps

2012-01   -0.596553
2012-02    0.762417
2012-03   -0.988757
2012-04   -0.925194
2012-05    1.150498
Freq: M, dtype: float64

In [50]:
ps.to_timestamp() #會變成每個月的1號

2012-01-01   -0.596553
2012-02-01    0.762417
2012-03-01   -0.988757
2012-04-01   -0.925194
2012-05-01    1.150498
Freq: MS, dtype: float64

In [ ]:
# Categoricals

In [65]:
df = pd.DataFrame(
    {"id": [1, 2, 3, 4, 5, 6], "raw_grade": ["a", "b", "b", "a", "a", "e"]}
)

df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [66]:
# 將欄位"raw_grade"的type轉成category
print(df.dtypes)

df["grade"] = df["raw_grade"].astype("category")

df["grade"]

id            int64
raw_grade    object
dtype: object

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): ['a', 'b', 'e']

In [68]:
# 按照level做rename
df["grade"].cat.categories = ["very good", "good", "very bad"]

df

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [70]:
df["grade"] = df["grade"].cat.set_categories(
    ["very bad", "bad", "medium", "good", "very good"]
)

df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): ['very bad', 'bad', 'medium', 'good', 'very good']

In [71]:
#根據"grade"的level去排序，而不是index
df.sort_values(by="grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

In [72]:
#統計每個level的數量
df.groupby("grade").size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64

In [74]:
# Getting data in/out

df.to_csv("foo.csv")

df = pd.read_csv("foo.csv")

df

   Unnamed: 0  id raw_grade      grade
0           0   1         a  very good
1           1   2         b       good
2           2   3         b       good
3           3   4         a  very good
4           4   5         a  very good
5           5   6         e   very bad